Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/prison_system/irish_prisoners_overseas.html.txt.tmx
Source language: en
Languages: ga

source: Irish prisoners overseas face significant difficulties, including an unfamiliar legal system, discrimination and language barriers
ga: Bíonn deacrachtaí suntasacha roimh phríosúnaigh Éireannacha thar lear, lena n-áirítear córas dlí neamhghnách, idirdhealú agus bacainní teanga

source: Some prisoners experience extreme hardship, with limited access to basic necessities, and in some jurisdictions prison conditions and safety are a major cause of concern
ga: Bíonn roinnt príosúnach thíos le fíor-chruatan, agus rochtain theoranta acu ar bhunriachtanais, agus i roinnt dlínsí, is údar mór buartha coinníollacha agus sábháilteacht phríosúin

source: Restrictions on communication, language and cultural differences are some of the problems that the families of prisoners overseas encounter
ga: I measc cuid de na fadhbanna a mbíonn teaghlaigh na bpríosúnach thar lear thíos leo, tá srianta ar chumarsáid, éagsúlachtaí teanga agus cultúrtha

source: The Irish Council for Prisoners Overseas estimates that there are up to 1,000 Irish citizens in prison outside Ireland at any one time
ga: Measann Comhairle na hÉireann um Príosúnaigh thar Lear go mbíonn a mhéid agus 1,000 saoránach Éireannach i bpríosún lasmuigh d'Éirinn ag aon tráth ar bith

source: In 2007 the Department of Foreign Affairs published a Report on Prisoners Abroad
ga: D’fhoilsigh an Roinn Gnóthaí Eachtracha Tuarascáil ar Phríosúnaigh thar Lear in 2007

source: Ireland is a signatory to the Council of Europe Convention on the Transfer of Sentenced Persons, which allows prisoners to apply to be transferred home to serve their prison sentence in their own country
ga: Sínitheoir í Éire le Comhairle na hEorpa um Aistriú Daoine ar cuireadh Pianbhreith orthu, a ligeann do phríosúnaigh iarratas a dhéanamh go n-aistreofar abhaile iad chun a bpianbhreith phríosúin a chaitheamh ina dtír féin

source: In order for a transfer to take place there must be three-way consent
ga: Ní mór go dtabharfaidh trí pháirtí toiliú chun aistriú a dhéanamh

source: The prisoner, the sentencing country and the prisoner’s home country all have to agree to the transfer
ga: Ní mór don phríosúnach, don tír a ghearr an phianbhreith agus do thír dhúchais an phríosúnaigh comhaontú chun an t-aistriú a dhéanamh

source: There are four conditions that a prisoner must meet in order to be eligible to apply for a transfer:
ga: Is ann do cheithre choinníoll nach mór do phríosúnach sásamh d’fhonn bheith incháilithe chun iarratas a dhéanamh ar aistriú:

source: The prisoner must be a citizen of the country to which they wish to be transferred
ga: Ní mór go mbeidh an príosúnach ina s(h)aoránach den tír ar mian leo aistriú chuici

source: In some cases it will be enough if the prisoner is not a citizen but a permanent resident of a country
ga: I roinnt cásanna, glactar le príosúnach nach saoránach den tír ar mian leis/léi aistriú chuici, más buanchónaitheoir tíre an té sin

source: The sentence is final
ga: Is críochnaitheach don phianbhreith

source: A prisoner cannot apply for transfer before they face trial or until after all appeals have been heard
ga: Ní féidir le príosúnach iarratas a dhéanamh ar aistriú sula ndéantar iad a thriail nó go dtí gur éisteadh le gach achomharc

source: There must be at least six months left to serve on the sentence
ga: Ní mór go mbeidh ar a laghad sé mhí den phianbhreith fágtha le caitheamh

source: The crime that the prisoner is convicted of must also be a crime in his or her home country
ga: Ina theannta sin, ní mór go ndearna an príosúnach an choir ina t(h)ír féin dhúchais

source: An application for a transfer usually begins with the prisoner informing the prison authorities that he/she is interested in being transferred back to Ireland to serve his/her sentence
ga: Is gnách go dtosaíonn iarratas ar an aistriú nuair a chuireann an príosúnach údaráis an phríosúin ar an eolas gur spéis leis/léi bheith aistrithe ar ais go hÉirinn chun a p(h)ianbhreith a chaitheamh ann

source: Alternatively, the prisoner can express such an interest directly to the Minister for Justice and Equality (94 St. Stephen’s Green, Dublin 2, Ireland), but it is likely that this will add a number of weeks to the process
ga: Mar mhalairt air sin, féadfaidh an príosúnach an spéis sin a léiriú go díreach leis an Aire Dlí agus Cirt (94 Faiche Stiabhna, Baile Átha Cliath 2, Éire), ach is dócha go gcuirfidh seo roinnt seachtainí leis an bpróiseas

source: Whether or not a prisoner will be deported to Ireland following the completion of his/her sentence will depend on the country in which he/she is detained
ga: Braithfidh cibé acu an ndíbreofar nó nach ndíbreofar príosúnach go hÉirinn i ndiaidh dó/di a p(h)ianbhreith a chríochnú ar an tír ina bhfuil sé/sí á c(h)oimeád

source: Some countries will automatically deport an overseas prisoner if they have served a certain amount of time in prison or if they have any previous convictions
ga: Díbreoidh roinnt tíortha príosúnach thar lear go huathoibríoch má chaith siad méid áirithe ama sa phríosún nó murar ionchúisíodh iad riamh cheana féin

source: If deported it is very important that a prisoner holds on to whatever documentation he/she is given in respect of his/her imprisonment and subsequent deportation
ga: Má dhíbrítear an príosúnach, tá sé an-tábhachtach go gcoimeádann príosúnach pé cáipéisíocht a thugtar dó/di maidir lena p(h)ríosúnacht agus lena d(h)íbirt ina dhiaidh sin

source: This material will be helpful in obtaining benefits in Ireland
ga: Beidh an t-ábhar sin cabhrach chun sochair a fháil in Éirinn

source: Since 2007 Irish prisoners have been exempt from compulsory deportation from the United Kingdom upon completion of their sentence, save in exceptional circumstances
ga: Ó 2007 i leith, bhí príosúnaigh na hÉireann díolmhaithe ó dhíbirt éigeantach ón Ríocht Aontaithe ar chríochnú a bpianbhreithe dóibh, seachas faoi chúinsí eisceachtúla

source: Post-release: entitlement to social welfare
ga: An tráth sula scaoiltear leis an bpríosúnach: teidlíocht i leith leas sóisialach

source: To be entitled to certain social welfare payments a returning ex-prisoner must satisfy the habitual residence condition
ga: Chun a bheith i dteideal íocaíochtaí leasa shóisialaigh a fháil, ní mór d’iarphríosúnach atá ag filleadh ar a t(h)ír dhúchais an coinníoll gnáthchónaithe a shásamh

source: This means that the person has a close link to Ireland
ga: Ciallaíonn seo go bhfuil dlúthnasc ag an duine le hÉirinn

source: Proving that a person is habitually resident in Ireland relies heavily on the facts and applications are dealt with on a case-by-case basis
ga: Lena chruthú go bhfuil ghnáthchónaí ar dhuine in Éirinn, braitheann sé go mór go ndéileáiltear leis na fíricí agus leis na hiarratais ar bhonn cás ar chás

source: Deportation is usually considered to be an exception to the habitual residence condition
ga: Is gnách go meastar gurb eisceacht i leith an choinníll ghnáthchónaithe díbirt

source: In other words, people who are deported are not subject to the habitual residence condition
ga: I bhfriotal eile, ní bhíonn daoine a dhíbrítear faoi réir an choinníll ghnáthchónaithe

source: Irish Council for Prisoners Overseas
ga: Comhairle na hÉireann um Príosúnaigh Éireannacha thar Lear

source: The Irish Council for Prisoners Overseas (ICPO) is a charitable organisation, established by the Irish Catholic Bishops’ Conference in 1985
ga: Eagraíocht charthanachta is iad Comhairle na hÉireann um Príosúnaigh thar Lear (ICPO), a bhunaigh Comhdháil Easpag Caitliceach Éireann i 1985

source: It works on behalf of Irish prisoners overseas to provide information and support to these prisoners and their families
ga: Oibríonn siad ar son príosúnaigh Éireannacha thar lear chun faisnéis agus tacaíocht a chur ar fáil do na príosúnaigh seo agus dá dteaghlaigh

source: ICPO services include the following:
ga: Áireofar le seirbhísí an ICPO:

source: • Providing information and support to prisoners and their families in relation to a wide range of issues, including repatriation, deportation, health and legal matters, discrimination and ill-treatment
ga: • Faisnéis agus tacaíocht a chur ar fáil do phríosúnaigh agus dá dteaghlaigh maidir le réimse fairsing saincheisteanna, lena n-áirítear aisdiúchiú, díbirt, saincheisteanna sláinte agus dlíthiúla, idirdhealú agus drochíde

source: • Representing prisoners’ interests to relevant parties (Irish embassies and consulates, welfare agencies, probation and legal officers)
ga: • Ionadaíocht a dhéanamh do leas príosúnach do pháirtithe ábhartha (ambasáidí agus consalachtaí Éireannacha, gníomhaireachtaí leasa, oifigigh phromhaidh agus dlí)

source: • Monitoring repatriation applications with the Department of Justice and Equality
ga: • Monatóireacht a dhéanamh ar iarratais ar aisdiúichiú leis an Roinn Dlí agus Cirt

source: • Providing assistance to prisoners in preparation for their release
ga: • Cúnamh a chur ar fáil do phríosúnaigh mar réiteach dá scaoileadh

source: • Visiting prisoners and assisting families with travel and accommodation for prison visits
ga: • Cuairt a thabhairt ar phríosúnaigh agus cabhrú le teaghlaigh le cúrsaí taistil agus cóiríochta le haghaidh cuairteanna príosúin

source: ICPO holds a Family Information Day each year to provide families with information and support and to give them the opportunity to meet other people who have a relative in prison overseas
ga: Cuireann an ICPO lá faisnéise ar siúl gach bliain chun faisnéis agus tacaíocht a chur ar fáil do theaghlaigh agus chun an deis a thabhairt dóibh casadh le daoine eile a bhfuil gaol leo i bpríosún thar lear

source: You can find more information in a leaflet about the ICPO (pdf)
ga: Is féidir leat tuilleadh eolais a fháil i mbileog mar gheall ar an ICPO (pdf)

source: A function of Irish embassies and consulates is to ensure that the rights of Irish citizens who are arrested or imprisoned abroad are fully respected
ga: Ceann d’fheidhmeanna ambasáidí agus consalachtaí Éireannacha is ea a chinntiú go mbíonn meas ar chearta saoránach Éireannach a gabhadh nó a cuireadh chun príosúin thar lear

source: In many cases the local authorities will only contact the Irish embassy or consulate if specifically asked to do so
ga: In go leor cásanna, ní rachaidh na húdaráis áitiúla i dteagmháil leis an ambasáid nó leis an gconsalacht Éireannach mura n-iarrtar go sonrach orthu amhlaidh a dhéanamh

source: Among other things, a consular officer can:
ga: I measc rudaí eile, féadfaidh oifigeach consalachta an méid a leanas a dhéanamh:

source: • Assist in getting information about prison arrangements
ga: • Cabhrú le faisnéis a fháil faoi shocruithe príosúin

source: • Provide information regarding local lawyers
ga: • Faisnéis a chur ar fáil maidir le haturnaetha áitiúla

source: • Provide families with information regarding the prison and legal arrangements in the country where their family member is detained
ga: • Faisnéis a chur ar fáil do theaghlaigh maidir le socruithe príosúin agus dlí sa tír ina bhfuil a nduine muinteartha á c(h)oimeád

source: • Help maintain contact with friends and family and arrange for funds provided by them to be transferred safely
ga: • Cabhrú le teagmháil a choimeád lena gcairde agus lena dteaghlach agus socrú a dhéanamh go n-aistreofar go sábháilte cistí a chuireann siad ar fáil

source: • Put the detained person in touch with relevant agencies such as ICPO
ga: • An duine atá faoi choinneáil a chur i dteagmháil le gníomhaireachtaí ábhartha, ar nós an ICPO

source: There is further information on consular assistance on the Department of Foreign Affairs and Trade’s website. Contacts ICPO Columba Centre Maynooth Co. Kildare Ireland Tel:(01) 505 3156 Fax:(01) 629 2363 Homepage: http://www.icpo.ie Email: icpo@iecon.ie ICPO (London) 50-52 Camden Square London NW1 9XB United Kingdom Tel:+44 207 482 4148 Fax:+44 207 482 4815 Email: prisoners@irishchaplaincy.org.uk Department of Justice and Equality 94 St
ga: Tá fáil ar thuilleadh faisnéise ar chúnamh consalachta ar shuíomh gréasáin na Roinne Gnóthaí Eachtracha
